app/controllers/comments_controller.rb

SELECT * FROM `comments` WHERE (`comments`.`id` = 1)
---
  def edit
    @comment = Comment.find(params[:id])

INSERT INTO `comments` (`user`, `updated_at`, `body`, `recipe_id`, `created_at`) VALUES('batman', '2010-05-06 03:06:53', 'aafafa', 1, '2010-05-06 03:06:53')
---
  def create
    @comment = Comment.new(params[:comment])

    respond_to do |format|
      if @comment.save

SELECT * FROM `comments` WHERE (`comments`.`id` = 1)
UPDATE `comments` SET `recipe_id` = 6, `updated_at` = '2010-05-04 21:23:22' WHERE `id` = 1
---
  def update
    @comment = Comment.find(params[:id])

    respond_to do |format|
      if @comment.update_attributes(params[:comment])

SELECT * FROM `recipes` WHERE (`recipes`.`id` = 1)
---
  def create
    @recipe = Recipe.find(params[:recipe_id])