app/controllers/cookbook_controller.rb

  def index
    @recipes = Recipe.find_recipe_to_view

    @drinks = Drink.find_drink_to_view
---
SELECT * FROM `recipes` ORDER BY Name
SELECT * FROM `drinks` ORDER BY name