app/controllers/create_ingredients_controller.rb

  def index
    @create_ingredients = CreateIngredient.all
---
SELECT * FROM `create_ingredients`

  def show
    @create_ingredient = CreateIngredient.find(params[:id])
---
SELECT * FROM `create_ingredients` WHERE (`create_ingredients`.`id` = 1)

  def edit
    @create_ingredient = CreateIngredient.find(params[:id])
---
SELECT * FROM `create_ingredients` WHERE (`create_ingredients`.`id` = 3)

  def create
    @create_ingredient = CreateIngredient.new(params[:create_ingredient])

    respond_to do |format|
      if @create_ingredient.save
---
INSERT INTO `create_ingredients` (`name`, `updated_at`, `unit`, `amount`, `created_at`) VALUES('Chicken thighs', '2010-05-04 16:05:55', 'lbs.', '50', '2010-05-04 16:05:55')

  def update
    @create_ingredient = CreateIngredient.find(params[:id])
---
SELECT * FROM `create_ingredients` WHERE (`create_ingredients`.`id` = 3)

  def destroy
    @create_ingredient = CreateIngredient.find(params[:id])
    @create_ingredient.destroy
---
SELECT * FROM `create_ingredients` WHERE (`create_ingredients`.`id` = 3)
DELETE FROM `create_ingredients` WHERE `id` = 3