app/controllers/drink_comments_controller.rb

  def create
    @drink_comment = DrinkComment.new(params[:drink_comment])

    respond_to do |format|
      if @drink_comment.save
---
INSERT INTO `drink_comments` (`updated_at`, `body`, `drink_id`, `created_at`) VALUES('2010-05-06 02:49:43', 'goes especially well with steak', NULL, '2010-05-06 02:49:43')

  def create
    @drink = Drink.find(params[:drink_id])
---
SELECT * FROM `drinks` WHERE (`drinks`.`id` = 1)