app/controllers/drinks_controller.rb

  def index
    @drinks = Drink.all
---
SELECT * FROM `drinks`

  def show
    @drink = Drink.find(params[:id])
---
SELECT * FROM `drinks` WHERE (`drinks`.`id` = 1)

  def edit
    @drink = Drink.find(params[:id])
---
SELECT * FROM `drinks` WHERE (`drinks`.`id` = 2)

  def create
    @drink = Drink.new(params[:drink])

    respond_to do |format|
      if @drink.save
---
INSERT INTO `drinks` (`name`, `updated_at`, `ingredients`, `prep_time`, `username`, `description`, `pairs`, `instructions`, `created_at`) VALUES('Guineess Draught', '2010-05-04 23:21:31', 'na', 0, 'Micky', 'smooth chocolatey draught', 'everything', 'na', '2010-05-04 23:21:31')

  def update
    @drink = Drink.find(params[:id])

    respond_to do |format|
      if @drink.update_attributes(params[:drink])
---
SELECT * FROM `drinks` WHERE (`drinks`.`id` = 2)
UPDATE `drinks` SET `ingredients` = ' * 2 cups limeade prepared from concentrate<br>\r\n * 1/2 cup pineapple juice<br>\r\n * 1/2 cup orange juice<br>\r\n * 2 fluid ounces tequila<br>\r\n * 1 fluid ounce orange liqueur<br>\r\n\r\n<hr>', `description` = 'By: THEATREGIRL <br>\r\n\"My husband was a bartender for a trendy restaurant when we met. Here\'s one of his home versions! Garnish with a lime wedge or an orange wedge.\"\r\n', `instructions` = '\r\n 1. Salt the rims of 2 large margarita glasses. To do so, pour salt onto a small plate, moisten the rims of the glasses on a damp towel and press them into the salt.<br>\r\n 2. In a pitcher combine limeade, pineapple juice, orange juice, tequila and orange liqueur. Stir well and pour into the glasses, being careful not to rinse off the salt.\r\n\r\n', `updated_at` = '2010-05-06 07:12:56' WHERE `id` = 3